# -*- coding: utf-8 -*-
"""
Created on Wed Apr  8 15:42:28 2020

@author: ТОМА
"""
from connector import read_query
import pandas as pd
locations_groups=read_query("select * from public.locations_groups" ,"archive")
fields=[
        'Організації',
        'Користувачі',
         'Місця',
        'Сума іонів',
        'Питома електропровідність',
        'Сульфати', 
        'Хлориди',
        'Розчинений кисень',
        '% насичення',
        '% насичення у гіполімніоні (для водойм)',
        'Завислі речовини', 
        'Прозорість',
        'pH',
        'Нафтопродукти'
        ]
col_names={
    'ion_sum':'Сума іонів', 
    'condc_spec':'Питома електропровідність',
    'sulfates':'Сульфати',
    'chlorides':'Хлориди',
    'oxygen_diss':'Розчинений кисень',
    'oxygen_sat': '% насичення',
    'oxygen_sat_hyp':'% насичення у гіполімніоні (для водойм)',
    'patricles_suspended':'Завислі речовини',
    'transparency':'Прозорість',
    'ph':'pH',
    'petroleum_products':'Нафтопродукти'
        }
subgroups={'Дніпро': 1,
 'Дунай': 2,
 'Закарпаття': 3,
 'Західний Лісостеп': 4,
 'Західний Степ': 5,
 'Карпати': 6,
 'Крим': 7,
 'Південне Полісся': 8,
 'Південний Лісостеп': 9,
 'Південний Степ': 10,
 'Північне Полісся ': 11,
 'Північний Лісостеп': 12,
 'Північний Степ': 13,
 "Приазов'я": 15,
 "Причорномор'я": 15,
 'Східне Полісся': 16,
 'Східний Лісостеп': 18,
 'Східний Степ': 18}